# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PathOfTravel..::..Create Method
PathOfTravel Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(View, XYZ, XYZ) | Creates a new path of travel between two points. |
| Create(View, XYZ, XYZ, PathOfTravelCalculationStatus%) | Creates a new path of travel between two points and provides creation result status. |

# See Also
PathOfTravel Class
PathOfTravel Members
Autodesk.Revit.DB.Analysis Namespace